; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared3 - mode
	thermograph4 - mode
	infrared2 - mode
	image0 - mode
	image1 - mode
	GroundStation0 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star1 - direction
	Star8 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph4)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Phenomenon9 infrared3)
	(have_image Phenomenon10 thermograph4)
	(have_image Planet11 thermograph4)
	(have_image Phenomenon12 image0)
	(have_image Star13 infrared2)
	(have_image Planet14 image1)
	(have_image Star15 image1)
))

)

; plan
1. (turn_to satellite1 groundstation4 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon10 instrument1 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 3 of 8
10. (turn_to satellite1 planet11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet11)
   goals met: 3 of 8
11. (take_image satellite1 planet11 instrument1 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 4 of 8
12. (turn_to satellite1 planet14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet14)
   goals met: 4 of 8
13. (take_image satellite1 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 5 of 8
14. (turn_to satellite1 star13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star13)
   goals met: 5 of 8
15. (take_image satellite1 star13 instrument1 infrared2)
   added: (have_image star13 infrared2)
   goals met: 6 of 8
16. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 6 of 8
17. (take_image satellite1 star15 instrument1 image1)
   added: (have_image star15 image1)
   goals met: 7 of 8
18. (turn_to satellite1 star3 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star3)
   goals met: 8 of 8
